Renova/src/DataProcessors/ЗагрузкаКодовНеисправности/ЗагрузкаКодовНеисправности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКодовНеисправности</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаЗагрузки</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Renova/src/Catalogs/КодыНеисправностей/КодыНеисправностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КодыНеисправностей</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ОбщиеКоды</name>
      <description>Общие коды</description>
    </items>
  </predefined>
  <attributes>
    <name>IDСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СимвольныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Действующий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </attributes>
</mdclass:Catalog>

Renova/src/DataProcessors/ЗагрузкаКодовНеисправности/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    
    ПараметрыФайла  = Новый Структура;
    ПараметрыФайла .Вставить("ИдентификаторФормы", УникальныйИдентификатор);
    
    Результат = Ждать РаботаСФайломКлиент.ВыбратьФайл(ПараметрыФайла);
    
    Если Результат.ФайлВыбран Тогда
        Объект.ПутьКФайлу = Результат.ПутьКФайлу;
    Иначе
        ПоказатьПредупреждение(,"Файл не выбран");
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте   
Процедура Загрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Выберите файл для загрузки");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере();
	ПоказатьОповещениеПользователя("Строк в таблице: " + Объект.ТаблицаЗагрузки.Количество());;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ТаблицаЗагрузки) Тогда
		ПоказатьПредупреждение(, "Загрузите файл в таблицу");
		Возврат;
	КонецЕсли; 
	
	СохранитьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере() 
	
	ТабЗнач = РаботаСCSVСервер.ПрочитатьФайлCSV(Объект.ПутьКФайлу);

	РаботаСФормамиСервер.ОбновитьДинамическуюТаблицу(ЭтотОбъект, "Объект.ТаблицаЗагрузки", "ТЗ","ДанныеЗагрузки", ТабЗнач);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ТаблицаЗагрузки = Объект.ТаблицаЗагрузки.Выгрузить();

	СозданоГрупп = 0;
	СозданоЭлементов = 0; 
	
	СоответствияВидовПродукции = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыПродукции.IDСайта КАК IDСайта,
		|	ВидыПродукции.Наименование КАК Наименование,
		|	ВидыПродукции.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыПродукции КАК ВидыПродукции";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяГруппа = Справочники.КодыНеисправностей.СоздатьГруппу();
		НоваяГруппа.Наименование = ВыборкаДетальныеЗаписи.Наименование;
		НоваяГруппа.Записать();
	
		ЧислоID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(ВыборкаДетальныеЗаписи.IDСайта);
		СоответствияВидовПродукции.Вставить(ЧислоID, НоваяГруппа.Ссылка); 
	КонецЦикла;
	
	// 1. Собираем уникальные числовые ID продуктов
	УникальныеIDВидов = Новый Массив;
	Для Каждого Строка Из ТаблицаЗагрузки Цикл
	    ЧислоID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(Строка.product_id);
	    Если УникальныеIDВидов.Найти(ЧислоID) = Неопределено Тогда
	        УникальныеIDВидов.Добавить(ЧислоID);
	    КонецЕсли;
	КонецЦикла;
	
	// 2. Получаем соответствие ID продукта -> ссылка на вид продукции
	СоответствияВидовПоИД = СоответствияСервер.ПолучитьСоответствиеВидовПродукцииОбщая(УникальныеIDВидов);
		
	СоответвияГруппы = Новый Соответствие;
	// 4. Создаём недостающие группы
	Для Каждого СтрокаДанных Из ТаблицаЗагрузки Цикл
		
		Если СтрокаДанных.is_folder = "1" Тогда
			// Создаём новую группу
			НоваяГруппа = Справочники.КодыНеисправностей.СоздатьГруппу();
			НоваяГруппа.Наименование = СтрокаДанных.title;
			НоваяГруппа.IDСайта = СтрокаДанных.id;
			НоваяГруппа.СимвольныйКод = СтрокаДанных.code;
			Если ЗначениеЗаполнено(СтрокаДанных.product_id) Тогда
				ЧислоID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.product_id); 
				НоваяГруппа.ВидПродукции = СоответствияВидовПоИД[ЧислоID]; 
				НоваяГруппа.Родитель = СоответствияВидовПродукции[ЧислоID]; 
			КонецЕсли;
			НоваяГруппа.Записать();
			СозданоГрупп = СозданоГрупп +1;
			СсылкаГруппы = НоваяГруппа.Ссылка;	
			СоответвияГруппы.Вставить(НоваяГруппа.IDСайта, СсылкаГруппы) 			
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого СтрокаДанных Из ТаблицаЗагрузки Цикл 
		//Создаем новый элемент
		Если СтрокаДанных.is_folder = "0" Тогда
			НовыйЭлемент = Справочники.КодыНеисправностей.СоздатьЭлемент();
			НовыйЭлемент.Наименование = СтрокаДанных.title;
			НовыйЭлемент.IDСайта = СтрокаДанных.id;
			НовыйЭлемент.СимвольныйКод = СтрокаДанных.code;
			Если ЗначениеЗаполнено(СтрокаДанных.product_id) Тогда
				ЧислоID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.product_id); 
				НовыйЭлемент.ВидПродукции = СоответствияВидовПоИД[ЧислоID]; 
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.parent_id) Тогда
			ЧислоID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.parent_id);
			НовыйЭлемент.Родитель = СоответвияГруппы[ЧислоID];
		КонецЕсли;
		НовыйЭлемент.Записать();
		СозданоЭлементов = СозданоЭлементов + 1;
		КонецЕсли;
    КонецЦикла;
	
	ТекстСообщенияПользователю = СтрШаблон("Загружено и создано: %2  групп справочника, %1 элементов справочника", СозданоЭлементов, СозданоГрупп);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю);
КонецПроцедуры


#КонецОбласти
